app/Controllers/AssetController.php

SELECT *
FROM `sub_kategori`
SELECT *
FROM `kategori`
---
    public function create()
    {
        $modelSubKategori = new SubKategoriModel();
        $modelKategori = new KategoriModel();

        $data['sub_kategori'] = $modelSubKategori->findAll();
        $data['kategori'] = $modelKategori->findAll();