app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $userModel = new UsersModel();

        // Ambil input dari form
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Cari pengguna berdasarkan username
        $user = $userModel->where('username', $username)->first();