app/Controllers/BarangController.php

SELECT COUNT(*) AS `numrows`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `barang`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `barang`.`id_lokasi`
WHERE `asset`.`kode_sub_kategori` = 'SK01'
SELECT `barang`.*, `asset`.`kode_barang`, `asset`.`nama_barang`, `asset`.`kode_kategori`, `asset`.`kode_sub_kategori`, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `barang`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `barang`.`id_lokasi`
WHERE `asset`.`kode_sub_kategori` = 'SK01'
ORDER BY `asset`.`nama_barang` ASC
 LIMIT 10
---
    public function detailBarangHabisPakai($kode_sub_kategori)
    {
        $barangModel = new BarangModel();

        // Ambil data barang dengan pagination
        $barangWithAssetLocationPengguna = $barangModel->select('barang.*, asset.kode_barang, asset.nama_barang, asset.kode_kategori, asset.kode_sub_kategori, pengguna.nama_pengguna, lokasi.nama_lokasi')
                                       ->join('asset', 'asset.id = barang.id_asset')
                                       ->join('pengguna', 'pengguna.id = barang.id_pengguna', 'left')
                                       ->join('lokasi', 'lokasi.id = barang.id_lokasi', 'left')
                                       ->where('asset.kode_sub_kategori', $kode_sub_kategori)
                                       ->orderBy('asset.nama_barang', 'ASC')
                                       ->paginate(10);

SELECT `barang`.*, `asset`.`kode_sub_kategori`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
WHERE `barang`.`id` = '6'
 LIMIT 1
SELECT *
FROM `lokasi`
SELECT *
FROM `pengguna`
---
    public function editBarangHabisPakai($id)
    {
        $barangModel = new BarangModel();
        $lokasiModel = new \App\Models\LokasiModel();
        $penggunaModel = new \App\Models\PenggunaModel();

        // Ambil data barang berdasarkan ID
        $barang = $barangModel->select('barang.*, asset.kode_sub_kategori')
                              ->join('asset', 'asset.id = barang.id_asset')
                              ->where('barang.id', $id)
                              ->first();

        // Ambil data barang , lokasi dan pengguna
        $data = [
            'barang' => $barang,
            'lokasi' => $lokasiModel->findAll(),
            'pengguna' => $penggunaModel->findAll(),