app/Controllers/KendaraanController.php

SELECT COUNT(*) AS `numrows`
FROM `kendaraan`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `kendaraan`.`id_pengguna`
SELECT `kendaraan`.*, `pengguna`.`nama_pengguna`, `pengguna`.`nip`, `pengguna`.`no_hp`, `pengguna`.`alamat`
FROM `kendaraan`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `kendaraan`.`id_pengguna`
 LIMIT 10
---
    public function kendaraan()
    {
        $model = model('KendaraanModel');
        $data['kendaraan'] = $model->getKendaraanWithPengguna()->paginate(10);