app/Controllers/LaporanController.php

    public function dataasset()
    {
        $db = \Config\Database::connect();

        // Query untuk mengambil data barang dari struktur database yang baru (general)
        $query = $db->table('barang')
            ->select('barang.*, asset.kode_sub_kategori, sub_kategori.nama_sub_kategori, kategori.nama_kategori,
                    pengguna.nama_pengguna, lokasi.nama_lokasi, YEAR(barang.tanggal_masuk) as tahun_perolehan')
            ->join('asset', 'asset.id = barang.id_asset', 'left')
            ->join('sub_kategori', 'sub_kategori.kode_sub_kategori = asset.kode_sub_kategori', 'left')
            ->join('kategori', 'kategori.kode_kategori = sub_kategori.kode_kategori', 'left')
            ->join('pengguna', 'pengguna.id = barang.id_pengguna', 'left')
            ->join('lokasi', 'lokasi.id = barang.id_lokasi', 'left')
            ->orderBy('kategori.nama_kategori, sub_kategori.nama_sub_kategori, barang.nama_barang')
            ->get()
            ->getResultArray();

        // Ambil data kategori untuk filter
        $kategoriQuery = $db->table('kategori')
            ->select('nama_kategori')
            ->orderBy('nama_kategori')
            ->get()
            ->getResultArray();

        // Ambil data sub kategori untuk filter
        $subKategoriQuery = $db->table('sub_kategori')
            ->select('sub_kategori.nama_sub_kategori, kategori.nama_kategori')
            ->join('kategori', 'kategori.kode_kategori = sub_kategori.kode_kategori', 'left')
            ->orderBy('kategori.nama_kategori, sub_kategori.nama_sub_kategori')
            ->get()
            ->getResultArray();

        // Ambil data barang untuk filter nama barang
        $barangQuery = $db->table('barang')
            ->select('nama_barang')
            ->where('nama_barang IS NOT NULL')
            ->where('nama_barang !=', '')
            ->groupBy('nama_barang')
            ->orderBy('nama_barang')
            ->get()
            ->getResultArray();
---
SELECT `barang`.*, `asset`.`kode_sub_kategori`, `sub_kategori`.`nama_sub_kategori`, `kategori`.`nama_kategori`, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`, YEAR(barang.tanggal_masuk) as tahun_perolehan
FROM `barang`
LEFT JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
LEFT JOIN `sub_kategori` ON `sub_kategori`.`kode_sub_kategori` = `asset`.`kode_sub_kategori`
LEFT JOIN `kategori` ON `kategori`.`kode_kategori` = `sub_kategori`.`kode_kategori`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `barang`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `barang`.`id_lokasi`
ORDER BY `kategori`.`nama_kategori`, `sub_kategori`.`nama_sub_kategori`, `barang`.`nama_barang`
SELECT `nama_kategori`
FROM `kategori`
ORDER BY `nama_kategori`
SELECT `sub_kategori`.`nama_sub_kategori`, `kategori`.`nama_kategori`
FROM `sub_kategori`
LEFT JOIN `kategori` ON `kategori`.`kode_kategori` = `sub_kategori`.`kode_kategori`
ORDER BY `kategori`.`nama_kategori`, `sub_kategori`.`nama_sub_kategori`
SELECT `nama_barang`
FROM `barang`
WHERE `nama_barang` IS NOT NULL
AND `nama_barang` != ''
GROUP BY `nama_barang`
ORDER BY `nama_barang`

    public function getSubKategoriByKategori()
    {
        $kategori = $this->request->getGet('kategori');

        if (empty($kategori)) {
            return $this->response->setJSON([]);
        }

        $db = \Config\Database::connect();
        $subKategori = $db->table('sub_kategori')
            ->select('sub_kategori.nama_sub_kategori')
            ->join('kategori', 'kategori.kode_kategori = sub_kategori.kode_kategori', 'left')
            ->where('kategori.nama_kategori', $kategori)
            ->orderBy('sub_kategori.nama_sub_kategori')
            ->get()
            ->getResultArray();
---
SELECT `sub_kategori`.`nama_sub_kategori`
FROM `sub_kategori`
LEFT JOIN `kategori` ON `kategori`.`kode_kategori` = `sub_kategori`.`kode_kategori`
WHERE `kategori`.`nama_kategori` = 'Habis Pakai '
ORDER BY `sub_kategori`.`nama_sub_kategori`