app/Controllers/LokasiController.php

    public function lokasi()
    {
        $data = [
            'lokasi' => $this->modelLokasi->paginate(10),
            'pager'  => $this->modelLokasi->pager,
        ];
---
SELECT *
FROM `lokasi`