app/Controllers/SubKategoriController.php

    public function index()
    {
        // Ambil data dari database menggunakan model
        $dataPerPage = 10; // Jumlah data per halaman
        $data = [
            'sub_kategori' => $this->subKategoriModel->paginate($dataPerPage), // Ambil data dengan pagination
            'pager' => $this->subKategoriModel->pager, // Kirim pager untuk pagination
        ];
---
SELECT *
FROM `sub_kategori`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `sub_kategori`

    public function create()
    {
        $modelKategori = new KategoriModel(); // Correct variable name to match usage
        $data['kategori'] = $modelKategori->findAll();
---
SELECT *
FROM `kategori`