app/Models/SubKategoriModel.php

SELECT `sub_kategori`.*, `kategori`.`nama_kategori`, `kategori`.`kode_kategori`
FROM `sub_kategori`
JOIN `kategori` ON `kategori`.`kode_kategori` = `sub_kategori`.`kode_kategori`
WHERE `kategori`.`nama_kategori` = 'Habis Pakai'
---
   public function getSubKategoriWithKategori($kategori)
    {
        return $this->select('sub_kategori.*, kategori.nama_kategori, kategori.kode_kategori')
                    ->join('kategori', 'kategori.kode_kategori = sub_kategori.kode_kategori')
                    ->where('kategori.nama_kategori', $kategori)
                    ->findAll();